---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FilterInverseRule Properties
FilterInverseRule Class See Also Send Feedback
---

The FilterInverseRule type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from FilterRule.) |

# See Also

FilterInverseRule Class

Autodesk.Revit.DB Namespace